[
  {
    "title": "RIT Global Cybersecurity Institute",
    "subtitle": "Software Security Engineer",
    "details": "Led the development of security-focused software solutions, including an automated SBOM generation tool and the National Vulnerability Intelligence Platform. Designed and implemented scalable microservices using Java Spring Boot, enabling efficient analysis and reporting of software dependencies. Optimized PostgreSQL queries and database schemas to enhance data retrieval performance. Developed robust end-to-end testing suites with JUnit and Selenium to ensure system reliability. Established CI/CD pipelines using Docker and GitHub Actions to automate testing and deployments, greatly reducing wasted development and integration time. Collaborated with cross-functional teams to enforce security best practices throughout the SDLC.",
    "technologies": [
      { "name": "PGSQL", "url": "https://www.postgresql.org" },
      { "name": "Java Spring Boot", "url": "https://spring.io/projects/spring-boot" },
      { "name": "Docker", "url": "https://www.docker.com/" },
      { "name": "JUnit", "url": "https://junit.org/junit5/" },
      { "name": "Selenium", "url": "https://www.selenium.dev/" },
      { "name": "CI/CD", "url": "https://github.com/features/actions" }
    ],
    "startDate": "Dec 2022",
    "endDate": "May 2024"
  },
  {
    "title": "Rochester Institute of Technology",
    "subtitle": "Software Engineering Course Assistant",
    "details": "Provided in-depth guidance on full-stack web development concepts, focusing on responsive design and scalable architectures. Assisted students through one-on-one mentoring, office hours, and study sessions, ensuring comprehension of fundamental engineering principles. Conducted thorough code reviews, offering detailed feedback to improve maintainability, performance, and adherence to best practices. Graded assignments with a focus on software quality, testing, and adherence to industry standards.",
    "technologies": [
      { "name": "React", "url": "https://reactjs.org/" },
      { "name": "Reactstrap", "url": "https://reactstrap.github.io/?path=/story/home-installation--page" },
      { "name": "Node.js", "url": "https://nodejs.org/" },
      { "name": "JavaScript", "url": "https://developer.mozilla.org/en-US/docs/Web/JavaScript" },
      { "name": "MongoDB", "url": "https://www.mongodb.com/" }
    ],
    "startDate": "Aug 2022",
    "endDate": "Dec 2022"
  }
]
