[
  {
    "title": "RIT ESL Global Cybersecurity Institute",
    "subtitle": "Team Lead - Software Security",
    "details": "Led a team of developers in advancing security-focused software initiatives, overseeing the continued development of the SBOM generation tool and National Vulnerability Intelligence Platform. Defined and enforced best practices in system design, testing automation, and CI/CD to improve software reliability and maintainability. Coordinated cross-functional collaboration between developers, security analysts, and QA engineers to optimize workflows. Guided the integration of advanced security analysis techniques into microservices architecture, ensuring scalable and secure solutions.",
    "technologies": ["PostgreSQL", "Spring Boot", "Docker", "JUnit", "Selenium", "CI/CD"],
    "startDate": "Apr 2023",
    "endDate": "May 2024"
  },
  {
    "title": "RIT ESL Global Cybersecurity Institute",
    "subtitle": "Software Security Engineer",
    "details": "Developed security-focused software solutions, including an automated SBOM generation tool and the National Vulnerability Intelligence Platform. Designed and implemented scalable microservices using Java Spring Boot to facilitate efficient software dependency analysis. Optimized PostgreSQL queries and schemas for improved data retrieval performance. Built comprehensive end-to-end testing suites using JUnit and Selenium to ensure system reliability. Established CI/CD pipelines with Docker and GitHub Actions, automating testing and deployment to streamline development processes.",
    "technologies": ["PostgreSQL", "Spring Boot", "Docker", "JUnit", "Selenium", "CI/CD"],
    "startDate": "Dec 2022",
    "endDate": "Apr 2023"
  },
  {
    "title": "Rochester Institute of Technology: GCCIS",
    "subtitle": "Software Engineering Course Assistant",
    "details": "Provided in-depth guidance on full-stack web development concepts, focusing on responsive design and scalable architectures. Assisted students through one-on-one mentoring, office hours, and study sessions, ensuring comprehension of fundamental engineering principles. Conducted thorough code reviews, offering detailed feedback to improve maintainability, performance, and adherence to best practices. Graded assignments with a focus on software quality, testing, and adherence to industry standards.",
    "technologies": ["JavaScript", "React", "Node.js", "MongoDB"],
    "startDate": "Aug 2022",
    "endDate": "Dec 2022"
  }
]