[
  {
    "title": "Personal Portfolio Website",
    "subtitle": "Responsive personal portfolio website showcasing projects and skills",
    "details": "Developed a personal portfolio website using Create React App with TypeScript for type safety and scalability. Styled the application with Material-UI to ensure a consistent and responsive design across devices. Implemented a GitHub Actions workflow for continuous integration and deployment, automating the build and deployment process to GitHub Pages. Followed best practices in code organization and version control to maintain a clean and maintainable codebase.",
    "technologies": [
      { "name": "React", "url": "https://reactjs.org/" },
      { "name": "TypeScript", "url": "https://www.typescriptlang.org/" },
      { "name": "Material-UI", "url": "https://mui.com/" },
      { "name": "CI/CD", "url": "https://github.com/features/actions" },
      { "name": "GH Pages", "url": "https://pages.github.com/" }
    ],
    "startDate": "Feb 2025",
    "endDate": "Present"
  },
  {
    "title": "Single Pane of Glass - Honeywell",
    "subtitle": "Web app for centralizing data visualization across cloud data sources",
    "details": "Designed and developed a full-stack web application that aggregates and visualizes data from multiple cloud providers, enabling real-time monitoring and analysis. Engineered a scalable microservices architecture using the MERN stack to ensure seamless integration of backend services with an interactive frontend. Enhanced a data pipeline framework to ingest and process large-scale data sources. Optimized API performance and database queries to handle high-throughput data streams efficiently. Established CI/CD pipelines with Docker and GitHub Actions to enable rapid and reliable deployments.",
    "technologies": [
      { "name": "MERN", "url": "https://www.mongodb.com/en-us/resources/languages/mern-stack" },
      { "name": "LEG", "url": "https://grafana.com/grafana/dashboards/1004-elasticsearch/" },
      { "name": "Docker", "url": "https://www.docker.com/" },
      { "name": "Kubernetes", "url": "https://kubernetes.io" }
    ],
    "startDate": "Aug 2024",
    "endDate": "Present"
  },
  {
    "title": "National Vulnerability Intelligence Platform",
    "subtitle": "Security analysis and reporting for software dependencies",
    "details": "Developed a security intelligence platform to analyze, track, and report vulnerabilities in software dependencies. Designed a microservices-based architecture with Spring Boot to enable modular and scalable data processing. Built an automated repository scanning framework to detect vulnerabilities in public and private repositories, integrating real-time vulnerability databases. Utilized MySQL for structured data storage and optimized queries for fast data retrieval. Containerized services using Docker and orchestrated deployments with Kubernetes for high availability and fault tolerance.",
    "technologies": [
      { "name": "Java Spring Boot", "url": "https://spring.io/projects/spring-boot" },
      { "name": "MySQL", "url": "https://www.mysql.com" },
      { "name": "Docker", "url": "https://www.docker.com/" },
      { "name": "Kubernetes", "url": "https://kubernetes.io/" },
      { "name": "CI/CD", "url": "https://github.com/features/actions" }
    ],
    "startDate": "May 2023",
    "endDate": "March 2024"
  },
  {
    "title": "Automated SBOM Generation",
    "subtitle": "Automated SBOM generation using Java and NLP techniques",
    "details": "Developed a Java-based tooling system for automated Software Bill of Materials (SBOM) generation, leveraging natural language processing (NLP) to analyze and extract software dependencies from repositories. Utilized polymorphic design patterns to create an extensible architecture that supports multiple dependency file formats. Implemented efficient file parsing techniques to improve processing speed and accuracy. Integrated Spring Boot for scalable API endpoints and streamlined dependency management with Maven. Ensured code reliability through JUnit-based testing and automated CI/CD pipelines, achieving 85%+ line coverage and streamlining successful deployments.",
    "technologies": [
      { "name": "Java Spring Boot", "url": "https://spring.io/projects/spring-boot" },
      { "name": "Maven", "url": "https://maven.apache.org/" },
      { "name": "NLP", "url": "https://en.wikipedia.org/wiki/Natural_language_processing" },
      { "name": "JUnit", "url": "https://junit.org/junit5/" },
      { "name": "CI/CD", "url": "https://github.com/features/actions" }
    ],
    "startDate": "Dec 2022",
    "endDate": "May 2023"
  },
  {
    "title": "Multi-User Dungeon",
    "subtitle": "Text-based multiplayer adventure game with a modular save system",
    "details": "Designed and developed a command-line interface (CLI) for seamless system-wide user interaction, implementing the Command design pattern for extensibility. Built a robust snapshot system enabling full and quick saving/loading of all game assets, utilizing the Memento design pattern to track game states efficiently. Ensured all game entities, including maps, rooms, enemies, chests, and players, were JSON-serializable by default using Jackson for streamlined data persistence. Collaborated in a team of five, applying object-oriented design principles and software design patterns to maintain modularity and scalability.",
    "technologies": [
      { "name": "Java", "url": "https://www.java.com" },
      { "name": "Jackson ORM", "url": "https://github.com/FasterXML/jackson" },
      { "name": "Design Patterns", "url": "https://en.wikipedia.org/wiki/Design_Patterns" }
    ],
    "startDate": "Jan 2022",
    "endDate": "May 2023"
  }
]
